{
  "name": "Iago Jesus",
  "photo": "https://avatars.githubusercontent.com/u/86308522?s=400&u=fd638dd57484d6323c33036cfcf726cfa8d693b1&v=4",
  "occupation": "UX/Frontend Developer",
  "location": "Belo horizonte - MG",
  "phone": "+55 (31) 9 9882-9940",
  "email": "iago.luancj@gmail.com",
  "apiGitHub": "https://api.github.com/users/iagoluancj",
  "socialMedias": {
    "github": "https://github.com/iagoluancj",
    "linkedin": "https://www.linkedin.com/in/iago-luan-4b4b02220/",
    "instagram": "https://www.instagram.com/iago.luancj/"
  },
  "resume": "Me chamo Iago, tenho 23 anos e sou apaixonado por tecnologia desde criança. Após a adolescência, descobri também a paixão pela psicologia, buscando entender o porquê as pessoas são como são. Sou amante de astronomia e um ávido fã de ficção científica. Nas horas vagas um jogador mediano.",
  "resume1": "Possuo uma boa análise da experiência do usuário (UX) devido a experiências anteriores com contato direto a usuários finais e colaboradores. Tenho também como parte essencial de meu curriculo boas habilidades em desenvolvimento web, onde transformamos ideias em realidade para atender às necessidades do usuário. No mais, é isso! Me resumir em pouco mais de 2000 caracteres é muito pouco para me conhecer, contudo, é o inicio da nossa conversa. Abaixo, há um pouco mais sobre minhas habilidades técnicas.",
  "skills": {
    "hardSkills": [
      {
        "name": "JavaScript",
        "level": "Intermédiario",
        "logo": "https://cdn.icon-icons.com/icons2/2107/PNG/512/file_type_js_icon_130510.png",
        "description": "Tenho uma base sólida com JS, o que me permite produzir resultados satisfatórios com os recursos disponíveis."
      },
      {
        "name": "Figma",
        "level": "Intermédiario",
        "logo": "https://cdn.icon-icons.com/icons2/2699/PNG/512/figma_logo_icon_170157.png",
        "description": "Tenho prática com o uso do Figma, onde consigo criar e compreender projetos sem dificuldade."
      },
      {
        "name": "AWS DevOps",
        "level": "Intermédiario",
        "logo": "https://cdn.iconscout.com/icon/free/png-256/free-aws-1869025-1583149.png",
        "description": "Concluí o curso 'DevOps on AWS Specialization - Amazon' e já utilizo alguns dos microservios da AWS em meu trabalho."
      },
      {
        "name": "Typescript",
        "level": "Básico",
        "logo": "https://cdn.icon-icons.com/icons2/2107/PNG/512/file_type_typescript_icon_130108.png",
        "description": "Tenho conhecimentos que variam de básicos a intermediários em TS, abrangendo uma boa compreensão do seu uso."
      },
      {
        "name": "React",
        "level": "Básico",
        "logo": "https://cdn.icon-icons.com/icons2/2415/PNG/512/react_original_logo_icon_146374.png",
        "description": "Tenho conhecimento básico a quase intermediário em React, sendo capaz de criar projetos com facilidade."
      },
      {
        "name": "NextJS",
        "level": "Básico",
        "logo": "https://cdn.icon-icons.com/icons2/3392/PNG/512/nextjs_icon_213852.png",
        "description": "Iniciando com NEXTJS, tenho noções iniciais e consigo criar algumas páginas simples."
      },
      {
        "name": "SQL",
        "level": "Básico",
        "logo": "https://cdn.icon-icons.com/icons2/273/PNG/256/icon_sql_256_30046.png",
        "description": "Estou me especializando em SQL para uso no trabalho e concluí o curso 'SQL: A Practical Introduction for Querying Databases - IBM'"
      },
      {
        "name": "HTML5",
        "level": "Avançado",
        "logo": "https://cdn.icon-icons.com/icons2/1488/PNG/512/5352-html5_102567.png",
        "description": "Sólidos conhecimentos em HTML5, como estruturação sintática e tags."
      },
      {
        "name": "CSS3",
        "level": "Intermédiario",
        "logo": "https://cdn.icon-icons.com/icons2/2107/PNG/512/file_type_css_icon_130661.png",
        "description": "Conhecimento intermediário em CSS3 devido à sua extensão, porém possuo excelente habilidade para utilizá-lo"
      }
    ],
    "competencias": [
      "UX Design Certificate - Google Career (Completed)",
      "Análise e desenvolvimento de sistemas - Unopar (In progress)",
      "Computer technical course (Completed)",
      "Intermediate English"
    ]
  },
  "aboutMe": [
    {
      "title": "Desenvolvendo do início ao fim",
      "description": "Nos projetos apresentados no portfólio abaixo, há uma ampla variedade de plataformas visadas e tecnologias utilizadas em sua construção. Em alguns, desenvolvi o projeto desde a criação de empatia com o usuário até o desenvolvimento final. Em outros, contribuí apenas em partes específicas. Algumas das ferramentas e linguagens utilizadas incluem HTML5, CSS3, JavaScript, Figma, entre outras.",
      "icon": "https://cdn.icon-icons.com/icons2/3951/PNG/512/developer_software_icon_251042.png"
    },
    {
      "title": "Foco no melhor para o usuário",
      "description": "Comecei meus estudos em desenvolvimento e descobri minha verdadeira paixão no campo de UI/UX. Fiquei indeciso sobre qual caminho seguir, pois, apesar da preferência pelo UI/UX, ainda era fascinado por programar. Foi então que percebi uma oportunidade de integrar ambos. Entendi que não era uma limitação, mas sim uma combinação perfeita. Com isso, pude observar situações em que UX e DEV interagem de maneira primorosa para proporcionar a melhor experiência ao usuário",
      "icon": "https://cdn.icon-icons.com/icons2/1485/PNG/512/cv_102350.png"
    },
    {
      "title": "Acessibilidade e equidade para todos",
      "description": "Digo com humildade que oque aprendi nessa minha carga de conhecimento que tanto desenvolvimento quanto a experiência do usuário quando é focada na acessibilidade é algo que podemos ver apenas vantagens, seja esse foco no auxilio de deficiências permanentes ou temporárias, os benefícios de ferramentas adaptadas a isso é um melhor uso para todos tipos de usuários.",
      "icon": "https://cdn.icon-icons.com/icons2/2562/PNG/512/ui_ux_web_design_multidevice_responsive_layout_icon_153182.png"
    }
  ]
}